text = \
"""авг. — август
австр. — австрийский
австрал. — австралийский
авт. — автономный
адм. — административный
адм.-терр. — административно-территориальный
азерб. — азербайджанский
азиат. — азиатский
АИМК — Академия истории материальной культуры
АИПС — автоматизированная информационно-поисковая система
АИС — автоматизированная информационная система
акад. — академик
академич. — академический
акв. — акварель, акварельный
альм. — альманах
амер. — американский
аналитич. — аналитический
англ — английский
АН СССР — Академия наук СССР
анс. — ансамбль
АО — автономная область (а также округ)
АПН — Академия педагогических наук
апр. — апрель
АР — автономная республика
араб. — арабский
аристократич. — аристократический
артистич. — артистический
археологич. — археологический
архит. — архитектор
архитект. — архитектурный
арх-ра — архитектура
АХ — Академия художеств
Б. — Большой
бар. — барон
башк. — башкирский
белорус. — белорусский
бельг. — бельгийский
библ. — библиографический
биогр. — биографический
б-ка — библиотека
благотворит. — благотворительный
болг. — болгарский
бр. — братья
БРЭ — Большая Российская Энциклопедия
брит. — британский
бронз. — бронзовый
БСЭ — Большая Советская Энциклопедия
будд. — буддийский
бульв. — бульвар
бум. — бумажный
б-ца — больница
быв. — бывший
бюлл. — бюллетень
В. — восток
в. — век
в т.ч. — в том числе
вв. — века
ВГИК — Всесоюзный государственный институт кинематографии
ведомств. — ведомственный
вел. — великий
вел. кн. — великий князь
Вел. Отеч. война — Великая Отечественная война
венгер. — венгерский
верх. — верхний
веществ. — вещественный
визант. — византийский
вкл. — включая
внеш. — внешний
внутр. — внутренний
ВООПИК — Всероссийское общество охраны памятников истории и культуры
восст. — восстановленный; восстановительный
вост. — восточный
впосл. — впоследствии
врем. — временный
всерос. — всероссийский
всесоюз. — всесоюзный
вспомогат. — вспомогательный
ВХНРЦ — Всероссийский художественный научно-реставрационный центр им. И.Э. Грабаря
ВХУТЕМАС — Высшие государственные художественно-технические мастерские
вып. — выпуск
выс. — высота
высококачеств. — высококачественный
высш. — высший
г. — год; город
газ. — газета
ГА — Государственный архив
ГА РФ — Государственный архив Российской Федерации
ГАИМК — Государственная академия истории материальной культуры
гал. — галерея
ГАРФ — Государственный архив Российской Федерации
ГАФ — Государственный архивный фонд
ГБЛ — Государственная библиотека им. В.И. Ленина
ген. — генерал, генеральный
географич. — географический
ГИХЛ — Государственное издательство художественной литературы
гл. — главный
Главархив — Главное архивное управление
ГЛМ — Государственный литературный музей
гл. — глава, главный
гл. обр. — главным образом
ГМФ — Государственный музейный фонд
ГНИИР — Государственный научно-исследовательский институт реставрации
гг. — годы
голл. — голландский
гор. — городской
гос. — государственный
гос-во — государство
Гохран — Государственное хранилище
ГПБ — Государственная публичная библиотека им. М.Е. Салтыкова-Щедрина (Петербург)
гр. — граф
гражд. — гражданский
графич. — графический
греч. — греческий
груз. — грузинский
губ. — губерния; губернский
ГУЛАГ — Главное управление исправительно-трудовых лагерей
гуманистич. — гуманистический
д. — деревня
Д. Восток — Дальний Восток
ДВО РАН — Дальневосточное отделение Российской академии наук
действит. — действительный
дек. — декабрь
декор. — декоративный
декорац. — декорационный
декор.-прикл. — декоративно-прикладной
демокр. — демократический
дерев. — деревянный
дет. — детский
дипломатич. — дипломатический
дир. — директор
дис. — диссертация
дл. — длина
догматич. — догматический
док-т — документ
документ. — документальный
дол. — долина
дополнит. — дополнительный
др. — другой
драг. — драгоценный
драм. — драматический
др.-рус. — древнерусский
др.-христ. — древнехристианский
ЕАО — Еврейская автономная область
евр. — еврейский
европ. — европейский
ед. хр. — единица хранения
единств. — единственный
ежекварт. — ежеквартальный
епарх. — епархиальный
ж. — журнал
ж.д. — железная дорога
ж.-д. — железнодорожный
жел. — железный
жен. — женский
З. — запад
зав. — заведующий
загран. — заграничный
заключ. — заключительный
зал. — залив
зам. — заместитель
зап. — западный
зап.-европ. — западноевропейский
зап.-сиб. — западносибирский
заруб. — зарубежный
засл. — заслуженный
звук. — звуковой
значит. — значительный; значительно
зол. — золотой
идеологич. — идеологический
изв. — известный
изд. — издание
издат. — издательский
изд-во — издательство
изобразит. — изобразительный
ИЗОГИЗ — Государственное издательство изобразительного искусства
ИИМК — Институт истории материальной культуры Российской академии наук
ИКОМ — Международный совет музеев
ИКОМОС — Международный совет по памятникам и достопримечательным местам
ИКОФОМ — Международный комитет по музеологии
ИКТ — информационно-коммуникационные технологии
илл. — иллюстрация
иллюстрир. — иллюстрированный
ИМЛИ — Институт мировой литературы РАН
им. — имени
имп. — император
ингуш. — ингушский
индивид. — индивидуальный
иниц. — инициативный; инициатива
иностр. — иностранный
ин-т — институт
информ. — информационный
и.о. — исполняющий обязанности
ИРЛИ — Институт русской литературы (Пушкинский Дом) РАН
иск-во — искусство
искусств. — искусственный
исп. — испанский
иссл. — исследование
исслед. — исследовательский
историч. — исторический
итал. — итальянский
ИФЛИ — Институт философии, литературы и истории им. Н.Г. Чернышевского
кавказ. — кавказский
кам. — каменный
КАМИС — комплексная автоматизированная музейная информационная система
канд. — кандидатский; кандидат
кап. — капитальный
качеств. — качественный
квалифицир. — квалифицированный
керамич. — керамический
кириллич. — кириллический
кирп. — кирпичный
кит. — китайский
классификац. — классификационный
классицистич. — классицистический
классич. — классический
км — километр
кн. — князь
княж. — княжеский
кол-во — количество
количеств. — количественный
колл. — коллекция
коллекц. — коллекционный
коммерч. — коммерческий
кон. — конец
консервац. — консервационный
конф. — конференция
конфиск. — конфискованный
корр. — корреспондент
Кр. Север — Крайний Север
КПСС — Коммунистическая партия Советского Союза
краеведч. — краеведческий
крест. — крестьянский
к-рый — который
культ.-просвет. — культурно-просветительный
купеч. — купеческий
лекц. — лекционный
ленингр. — ленинградский
лит. — литературный
лит-ведение — литературоведение
лит-ра — литература
ЛИФЛИ — Ленинградский институт истории, философии и литературы
м — метр
М. — малый
м. — море
мат-лы — материалы
МГУ — Московский государственный университет им. М.В. Ломоносова
междунар. — международный
мемор. — мемориальный
метал. — металлический
методич. — методический
методологич. — методологический
мин-во — министерство
мир. — мировой
мифол. — мифологический
МИФЛИ — Московский институт истории, философии и литературы им. Н.Г. Чернышевского
МИХИМ — Московский институт историко-художественных изысканий и музееведения
мл. — младший
мн. — многие
многочисл. — многочисленный
мон. — монастырь
монг. — монгольский
монумент. — монументальный
мордов. — мордовский
моск. — московский
МПиРМ — Московский публичный и Румянцевекий музей
мрам. — мраморный
муж. — мужской
муз. — музыкальный
муницип. — муниципальный
Н. Новгород — Нижний Новгород
наб. — набережная
назв. — название
наиб. — наиболее
наим. — наименее
напр. — например
нар. — народный
Наркомпрос — Народный комиссариат просвещения
наруж. — наружный
нас. — население
наст. — настоящий
науч. — научный
нац. — национальный
национализ. — национализированный
нач. — начало
невостреб. — невостребованный
неизв. — неизвестный; неизвестно
нем. — немецкий
нем.-фаш. — немецко-фашистский
неск. — несколько
нидерл. — нидерландский
ниж. — нижний
НИИ — научно-исследовательский институт
норв. — норвежский
нояб. — ноябрь
нумизматич. — нумизматический
об-во — общество
обл. — область; областной
образоват. — образовательный
обществ. — общественный
объед. — объединённый
о-в — остров
одноим. — одноимённый
оз. — озеро
ОИРУ — Общество изучения русской усадьбы
ок. — около
окр. — округ; окружной
окт. — октябрь
ОНО — отдел народного образования
ОПИ — отдел письменных источников
опред. — определённый
опубл. — опубликованный
ОР — отдел рукописей
организац. — организационный
органич. — органический
орг-ция — организация
орнамент. — орнаментальный
осет. — осетинский
осн. — основан, основанный; основной
отд. — отдельный
откр. — открытый
офиц. — официальный
ОЦО — особо ценные культурные объекты
пам. — памятник
пед. — педагогический
пер. — переулок
первонач. — первоначальный
переим. — переименованный
периодич. — периодический
перc. — персидский
персон. — персональный
петерб. — петербургский
печ. — печатный
письм. — письменный
пл. — площадь
пластич. — пластический
п-ов — полуостров
подмоск. — подмосковный
пожизн. — пожизненный
позд. — поздний
под рук. — под руководством
полит. — политический
полиграф. — полиграфический
польск. — польский
пом. — помощник
помред — помощник редактора
пос. — посёлок
посв. — посвящённый
посл. — последний
послед. — последующий
пост. — постоянный
постр. — построенный
потомств. — потомственный
пр. — прочие
правительств. — правительственный
практич. — практический, практически
пр-во — правительство
предс. — председатель
през. — президент
преим. — преимущественный
преп. — преподобный
прижизн. — прижизненный
прикл. — прикладной
провинц. — провинциальный
произв. — произведение
произ-во — производство
производств. — производственный
просвет. — просветительский, просветительный
просп. — проспект
проф. — профессор; профессиональный
псевд. — псевдоним
публ. — публикация
публич. — публичный
р. — река
разл. — различный
размещ. — размещённый
район. — районный
РАН — Российская академия наук
РАПП — Российская ассоциация пролетарских писателей
располож. — расположенный
РАХН — Российская академия художественных наук
РГАДА — Российский государственный архив древних актов
РГАЛИ — Российский государственный архив литературы и искусства
РГБ — Российская государственная библиотека
РГГУ — Российский государственный гуманитарный университет
революц. — революционный
регион. — региональный
ред. — редактор; редакция
редакц. — редакционный
реж. — режиссёр
реконстр. — реконструированный
религ. — религиозный
реорганиз. — реорганизованный
реорганизац. — реорганизационный
респ. — республика
республ. — республиканский
реставр. — реставрированный
реставрац. — реставрационный
рим. — римский
рис. — рисунок
р-н — район
РНБ — Российская национальная библиотека им. Салтыкова-Щедрина
РО — рукописный отдел (института, библиотеки, музея)
род. — родился
РОДК — Русское общество друзей книги
РОСИЗО — «Росизопропаганда», Государственный музейно-выставочный центр «РОСИЗО»
рос. — российский
РПЦ — Русская православная церковь
руб. — рубль
рук. — руководитель
рук-во — руководство
рус. — русский
С. — север
с. — село
с.-петерб. — санкт-петербургский
самостоят. — самостоятельный
сб., сб-ки — сборник, сборники
св. — свыше
связ. — связанный
сев. — северный
секр. — секретарь
сент. — сентябрь
сер. — середина, серия
серебр. — серебряный
сиб. — сибирский
синтетич. — синтетический
систематизир. — систематизированный
систематич. — систематический
сканд. — скандинавский
скульпт. — скульптурный
слав. — славянский
след. — следующий
СМ — Совет Министров
см — сантиметр
см. — смотри
СО АН СССР — Сибирское отделение Академии наук СССР
СО РАН — Сибирское отделение Российской академии наук
собр. — собрание
собств. — собственный
сов. — советский
совм. — совместный; совместно
совр. — современный
созд. — созданный
сотр. — сотрудник
сотр-во — сотрудничество
сохр. — сохранившийся
соц. — социальный
социалистич. — социалистический
социологич. — социологический
соч. — сочинение
СП — Союз писателей СССР
СПбГУ — Санкт-Петербургский государственный университет
спец. — специальный; специально
специализир. — специализированный
специфич. — специфичный
справоч. — справочный
Ср. Азия — Средняя Азия
ср.-век. — средневековый
СССР — Союз Советских Социалистических Республик
ст. — станция, старший, статья
стан. — станица
старообрядч. — старообрядческий
старопеч. — старопечатный
старослав. — старославянский
стекл. — стеклянный
стилистич. — стилистический
стихотв. — стихотворный
стр-во — строительство
строит. — строительный
сузд. — суздальский
сценич. — сценичный
т., тт. — том, тома
т.е. — то есть
т.к. — так как
т.н. — так называемый
т.о. — таким образом
татар. — татарский
т-во — товарищество
творч. — творческий
театр. — театральный
театрализ. — театрализованный
тематич. — тематический
теоретич. — теоретический
терминологич. — терминологический
терр. — территория
террит. — территориальный
технич. — технический
типологич. — типологический
тов. — товарищ
торжеств. — торжественный
традиц. — традиционный
у. — уезд.
уезд. — уездный
укр. — украинский
универс. — универсальный
уник. — уникальный
ун-т — университет
урал. — уральский
учрежд. — учреждённый
уч-ще — училище
фактич. — фактический
февр. — февраль
филологич. — филологический
философ. — философский
фин. — финский
флам. — фламандский
фольк. — фольклорный
фотогр. — фотографический
франц. — французский
ф-т — факультет
фундамент. — фундаментальный
функц. — функциональный
хоз. — хозяйственный
христ. — христианский
хронолоrич. — хронологический
худ. — художник
художеств. — художественный
хут. — хутор
цв. — цветной
ЦБК — Центральное бюро краеведения
ЦГА — Центральный государственный архив
ЦГАДА — Центральный государственный архив древних актов
ЦГАЛИ — Центральный государственный архив литературы и искусства СССР
ЦГРМ — Центральные государственные реставрационные мастерские
центр. — центральный
централиз. — централизованный
церк. — церковный
ЦК — Центральный Комитет
черкес. — черкесский
четв. — четверть
чечен. — чеченский
числ. — численность; численный
чл. — член
чл.-корр. — член-корреспондент
чуваш. — чувашский
чугун. — чугунный
ш. — шоссе
швед. — шведский
шир. — ширина
эволюц. — эволюционный
экз. — экземпляр
экологич. — экологический
эксп. — экспонат
экспедиц. — экспедиционный
эксперимент. — экспериментальный
экспозиц. — экспозиционный
эмоц. — эмоциональный
эстетич. — эстетический
эт. — этаж
этнич. — этнический
этнографич. — этнографический
Ю. — юг
юж. — южный
яз. — язык
яз-ведение — языковедение
яз-знание — языкознание
языч. — языческий
якут. — якутский
янв. — январь
япон. — японский
яросл. — ярославский"""


for line in text.split("\n"):
    if ';' in line:
        continue
    a = line.split(" — ")
    krat = a[0].lower()
    word = a[1].lower()
    if ' ' in a[1]:
        continue
    print(f"{word}, {krat}")
    if word[-2:] == "ий" or word[-2:] == "ый":
        print(f"{word[:-2]}ая, {krat}")
        print(f"{word[:-2]}ое, {krat}")