import re

# =, + , - (когда минус), >, <, >=, <=, ==, !=, ~=, ≈ -

symbols = {
    "=": "равно",
    "+": "плюс",
    "-": "минус",
    ">": "больше",
    "<": "меньше",
    ""
}

data = {
        "температура в -13 градусов" : "температура в минус 13 градусов",
        "+5 градусов за бортом": " плюс 5 градусов за бортом",
        "7 + 3 - 2 равняется 9": "7 плюс 3 минус 2 равняется 9",
        "Сервис disney+": "Сервис disney плюс",
        "выражение 12+7 равно 19": "выражение 12 плюс 7 равно 19",
        "знак на конце-": "знак на конце минус",
        "+": "плюс",
        "в диапазоне 12-15 метров": "в диапазоне 12-15 метров",
        "в пределах двух-трех лет": "в пределах двух-трех лет",
        "в пределах двух - трех лет": "в пределах двух - трех лет",
        "самолет F-35": "самолет F-35"
    }


def replace(text):
    list_text = ["", *re.split("[ \n]", text), ""]

    previous_word = ""
    for index in range(1, len(list_text) - 1):

        current_word = list_text[index]
        next_word = list_text[index + 1]
    print(list_text)


def main():
    for i, v in data.items():
        replace(i)

if __name__ == "__main__":
    main()